---
kind: property
id: P:Autodesk.Revit.DB.FillGrid.Shift
source: html/b4c1ff59-af0c-0c1d-cabc-981fdb4c78b1.htm
---
# Autodesk.Revit.DB.FillGrid.Shift Property

Gets and sets the shift of the fill grid.

## Syntax (C#)
```csharp
public double Shift { get; set; }
```

## Remarks
Shift moves the pattern of dashes and spaces along the length of each new parallel line.
 Shift is ignored if the line is solid.